# Used to convert to usable version of code without processes
read_verilog -defer ../Modular_Optimized/top.v
hierarchy -check -top cnn_top_modular
proc
opt
techmap
dfflibmap -liberty /home/ashto/pdk/OpenROAD-flow-scripts/flow/platforms/sky130hs/lib/sky130_fd_sc_hs__tt_025C_1v80.lib
abc -liberty /home/ashto/pdk/OpenROAD-flow-scripts/flow/platforms/sky130hs/lib/sky130_fd_sc_hs__tt_025C_1v80.lib
clean
write_verilog -noattr -noexpr synth_out.v
